CSI API ETABS v1
cStory.SetStories_2 Method
 Sets the stories for the current tower.
 This function supersedes SetStories. Note: this function can only be used when no objects exist in the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetStories_2(
	double BaseElevation,
	int NumberStories,
	ref string[] StoryNames,
	ref double[] StoryHeights,
	ref bool[] IsMasterStory,
	ref string[] SimilarToStory,
	ref bool[] SpliceAbove,
	ref double[] SpliceHeight,
	ref int[] color
)
Function SetStories_2 (
	BaseElevation As Double,
	NumberStories As Integer,
	ByRef StoryNames As String(),
	ByRef StoryHeights As Double(),
	ByRef IsMasterStory As Boolean(),
	ByRef SimilarToStory As String(),
	ByRef SpliceAbove As Boolean(),
	ByRef SpliceHeight As Double(),
	ByRef color As Integer()
) As Integer
Dim instance As cStory
Dim BaseElevation As Double
Dim NumberStories As Integer
Dim StoryNames As String()
Dim StoryHeights As Double()
Dim IsMasterStory As Boolean()
Dim SimilarToStory As String()
Dim SpliceAbove As Boolean()
Dim SpliceHeight As Double()
Dim color As Integer()
Dim returnValue As Integer
returnValue = instance.SetStories_2(BaseElevation,
	NumberStories, StoryNames, StoryHeights,
	IsMasterStory, SimilarToStory, SpliceAbove,
	SpliceHeight, color)
int SetStories_2(
	double BaseElevation,
	int NumberStories,
	array<String^>^% StoryNames,
	array<double>^% StoryHeights,
	array<bool>^% IsMasterStory,
	array<String^>^% SimilarToStory,
	array<bool>^% SpliceAbove,
	array<double>^% SpliceHeight,
	array<int>^% color
)
abstract SetStories_2 :
        BaseElevation : float *
        NumberStories : int *
        StoryNames : string[] byref *
        StoryHeights : float[] byref *
        IsMasterStory : bool[] byref *
        SimilarToStory : string[] byref *
        SpliceAbove : bool[] byref *
        SpliceHeight : float[] byref *
        color : int[] byref -> int
Parameters
BaseElevation
Type: System.Double
 The elevation of the base [L]
NumberStories
Type: System.Int32
 The number of stories
StoryNames
Type: System.String[]
 The names of the stories
StoryHeights
Type: System.Double[]
 The story heights [L]
IsMasterStory
Type: System.Boolean[]
 Whether the story is a master story
SimilarToStory
Type: System.String[]
 If the story is not a master story, which master story the story is similar to
SpliceAbove
Type: System.Boolean[]
 This is True if the story has a splice height, and False otherwise
SpliceHeight
Type: System.Double[]
 The story splice height [L]
color
Type: System.Int32[]
 The display color for the story specified as an Integer
Return Value
Type: Int32
 Returns zero if the story data is successfully set, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewGridOnly(4, 12, 12, 4, 4, 24, 24)
       ret = SapModel.SetPresentUnits(ETABSv1.eUnits.kip_ft_F)
   'set stories
       Dim inStoryNames As String() = {"MyStory1", "MyStory2", "MyStory3", "MyStory4", "MyStory5", "MyStory6"}
       Dim inStoryHeights As Double() = {10, 10, 15, 10, 10, 20}
       Dim inIsMasterStory As Boolean() = {False, False, True, False, False, True}
       Dim inSimilarToStory As String() = {"MyStory3", "MyStory3", "None", "MyStory6", "", "None"}
       Dim inSpliceAbove As Boolean() = {False, True, False, True, False, False}
       Dim inSpliceHeight As Double() = {0, 1, 0, 2, 0, 0}
       Dim inColor as Integer() = {65535, 0, 255, 16711935, 16711680, 0}
       ret = SapModel.Story.SetStories_2(2.0, 6, inStoryNames, inStoryHeights, inIsMasterStory,
                                           inSimilarToStory, inSpliceAbove, inSpliceHeight, inColor)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace